{
  "nav": {
    "home": "Home",
    "medias": "MediasAPI",
    "finance": "FinanceAPI",
    "projects": "All Projects"
  },
  "home": {
    "title": "Gustavo Henrique | Developer",
    "description1": "I work in backend development building APIs, scalable applications and structured projects with software engineering best practices using Java and Spring. I work with clean architecture, SOLID principles, design patterns, version control, technical documentation and automated testing. I have experience in relational databases, data structures and algorithms, applying efficient and quality solutions.",
    "description2": "Here I present some personal projects that solve my daily problems, the solutions were designed and documented aiming to follow best practices and resources from the software development market.",
    "techTitle": "Technologies"
  },
  "allProjects": {
    "title": "All Projects"
  },
  "mediasAPI": {
    "menu": {
      "apresentacao": "Overview",
      "motivacao": "Motivation and Solution",
      "funcionalidades": "Key Features",
      "utilizandoApi": "Using the API",
      "praticas": "Practices Adopted"
    },
    "title": "Academic Grade Management and Projection REST API",
    "placeholder": "HERE",
    "apresentacao": {
      "title": "Overview",
      "docLink": "Technical documentation",
      "p1": "An intelligent academic management platform that transforms how students and professors handle assessments. The solution offers centralized grade storage, automatic average calculation, and primarily strategic projections that allow users to simulate scenarios and plan their performance in advance.",
      "p2": "The differentiator lies in flexibility: each course can have its own custom calculation method through customizable mathematical expressions. The system processes these expressions dynamically, identifies variables and constants through regex, and applies the Shunting Yard algorithm with reverse Polish notation (RPN) to ensure correct operator precedence — all without compromising performance or usability.",
      "p3": "Developed following SOLID principles and layered architecture, the API combines robust validations (Bean Validation), JWT authentication, automated tests with mocks, and OpenAPI 3 documentation. The solution was containerized with Docker and uses Spring Data JPA for optimized queries, demonstrating a complete and professional backend implementation."
    },
    "motivacao": {
      "title": "Motivation and Solution",
      "p1": "During the academic journey at university, managing grades or even just storing them is a process that can be automated efficiently. However, as each professor and course define their own evaluation methods and performance criteria according to their preferences and approaches, there is great variability and flexibility in this process.",
      "p2": "For the application to support these custom definitions, a solution based on regular expression processing was implemented, allowing dynamic identification and manipulation of variables, constants, and operators. This way, the calculation of final averages is automated flexibly and adaptable to different evaluation rules.",
      "p3": "Another challenge was implementing this dynamic calculation. The adopted solution uses reverse Polish notation (RPN), which eliminates the need for parentheses by defining the correct order of precedence directly in its structure. Additionally, an adaptation of the Shunting Yard algorithm was employed, using stacks and lists as data structures to ensure correct expression evaluation."
    },
    "funcionalidades": {
      "title": "Key Features",
      "items": [
        "Store grades in a structured and efficient way.",
        "Define custom methods for calculating averages.",
        "Automatically obtain the score needed to achieve academic goals.",
        "Simulate different scenarios for strategic planning.",
        "Manage courses."
      ]
    },
    "utilizandoApi": {
      "title": "Using the API",
      "login": {
        "title": "Login:",
        "item": "The user creates their profile by registering in the system."
      },
      "autenticacao": {
        "title": "Authentication:",
        "item": "The API validates credentials and, if successful, returns a JWT token."
      },
      "disciplinas": {
        "title": "Courses:",
        "item": "The user can create and edit their custom courses."
      },
      "projecoes": {
        "title": "Projections:",
        "item": "A projection is automatically created when defining the calculation method in the previous step. Users can create, edit, and view other projections."
      },
      "avaliacoes": {
        "title": "Assessments:",
        "item": "Also automatically created with each projection. Users can submit grades."
      }
    },
    "praticas": {
      "title": "Practices Adopted",
      "arquitetura": {
        "title": "Architecture and Design",
        "items": [
          "REST API with layered architecture",
          "Application of SOLID principles",
          "Dependency Injection",
          "Use of Data Transfer Object (DTO) pattern"
        ]
      },
      "validacao": {
        "title": "Validation and Security",
        "items": [
          "Custom validations and Bean Validation usage",
          "Implementation of authentication and authorization via JWT"
        ]
      },
      "erros": {
        "title": "Error Handling and Responses",
        "items": [
          "Standardized error capture and handling"
        ]
      },
      "documentacao": {
        "title": "Documentation",
        "items": [
          "API documentation with diagrams and examples",
          "Technical endpoint documentation with OpenAPI 3"
        ]
      },
      "testes": {
        "title": "Testing and Code Quality",
        "items": [
          "Automated tests with mock creation and separate environment"
        ]
      },
      "banco": {
        "title": "Database",
        "items": [
          "Relational database modeling with constraint definitions",
          "JPQL and native SQL queries with Spring Data JPA"
        ]
      },
      "ferramentas": {
        "title": "Tools and Deployment",
        "items": [
          "Use of API Client and Database Client during development",
          "Application encapsulation with Docker, creating custom images and containers",
          "Code versioning with Git"
        ]
      },
      "tecnologias": {
        "title": "Technologies"
      }
    }
  },
  "financeAPI": {
    "menu": {
      "apresentacao": "Overview",
      "motivacao": "Motivation and Solution",
      "funcionalidades": "Key Features",
      "utilizandoApi": "Using the API",
      "praticas": "Practices Adopted"
    },
    "title": "GraphQL API for Banking Integration, Analysis and Transaction Classification",
    "placeholder": "HERE",
    "apresentacao": {
      "title": "Overview",
      "docLink": "Technical documentation",
      "p1": "A complete GraphQL API for intelligent financial management that connects the Open Finance ecosystem to the end user. The platform automatically captures banking transactions via webhooks, organizes movements into custom categories, and offers detailed analyses with automatic balance calculation — all through flexible and precise GraphQL queries.",
      "p2": "The system was designed to solve a real problem: the difficulty of consolidating and categorizing financial movements from multiple accounts. Through integration with the Pluggy aggregator in a sandbox environment, the API simulates the behavior of an Open Finance participating institution, processing webhooks in real-time and persisting data with complex relationships in PostgreSQL.",
      "p3": "The architecture implements messaging with Kafka for asynchronous processing, Spring Security with X-API-KEY authentication, and uses GraphQL to provide clients (dashboards, mobile apps, integrations) the flexibility to request exactly the necessary data. The project demonstrates deep knowledge in external API integration, real-time event processing, and modern GraphQL-oriented API design."
    },
    "motivacao": {
      "title": "Motivation and Solution",
      "p1": "The initial intention was to build an integrated and functional system capable of automatically processing financial movements. However, obtaining, classifying, and analyzing banking transactions in real-time is a process that demands a high level of integration with financial institutions. Direct access to real banking data requires authorization as an institution in Open Finance. To pursue this purpose, a solution was implemented using a financial data aggregator that offers a sandbox environment, simulating the behavior of an Open Finance participating institution. Thus, it was possible to simulate webhooks, testing real scenarios without depending on sensitive data.",
      "p2": "Another relevant point was the choice of GraphQL, which enables flexible and precise queries, returning only the truly necessary data for each client or integration. This facilitates the construction of dynamic dashboards and front-end applications, as well as personal analysis.",
      "p3": "Additionally, the API allows intelligent transaction categorization, enabling the end user or application to select only relevant entries and automatically calculate the balance for analysis, filtering, or integration with custom financial reports."
    },
    "funcionalidades": {
      "title": "Key Features",
      "items": [
        "Automatically receive transactions via Pluggy webhook.",
        "Persist transactions in a relational database.",
        "Classify by custom categories.",
        "Query transaction history.",
        "View transactions according to filters - by category, period, and type.",
        "Automatic balance calculation based on selected transactions."
      ]
    },
    "utilizandoApi": {
      "title": "Using the API",
      "users": {
        "title": "Users:",
        "item": "The user creates their profile by registering in the system."
      },
      "accounts": {
        "title": "Accounts:",
        "item": "The user can create and edit their accounts, not yet connected with the aggregator."
      },
      "integration": {
        "title": "FinancialIntegration:",
        "item": "With the account created, it's possible to connect it with a financial institution."
      },
      "category": {
        "title": "Category:",
        "item": "Users create and manage their own categories and subcategories that can be assigned to transactions"
      },
      "transactions": {
        "title": "Transactions:",
        "item": "Store and select desired transactions, automatically calculating the balance."
      }
    },
    "praticas": {
      "title": "Practices Adopted",
      "arquitetura": {
        "title": "Architecture and Design",
        "items": [
          "GraphQL API with layered architecture",
          "Application of SOLID principles",
          "Dependency Injection",
          "Use of Data Transfer Object (DTO) pattern",
          "Use of tunneling tool (Ngrok)",
          "Integration with external API data models (Pluggy)",
          "Messaging with Kafka",
          "Credential storage in files"
        ]
      },
      "validacao": {
        "title": "Validation and Security",
        "items": [
          "Custom validations and Bean Validation usage",
          "Implementation of authentication via X-API-KEY"
        ]
      },
      "erros": {
        "title": "Error Handling and Responses",
        "items": [
          "Standardized error capture and handling"
        ]
      },
      "documentacao": {
        "title": "Documentation",
        "items": [
          "API documentation with diagrams and examples",
          "Technical endpoint documentation with GraphiQL"
        ]
      },
      "testes": {
        "title": "Testing and Code Quality",
        "items": [
          "Automated tests with mock creation and separate environment"
        ]
      },
      "banco": {
        "title": "Database",
        "items": [
          "Relational database modeling with constraint definitions",
          "JPQL and native SQL queries with Spring Data JPA"
        ]
      },
      "ferramentas": {
        "title": "Tools and Deployment",
        "items": [
          "Use of API Client, Database Client, and Sandbox Environment during development",
          "Application encapsulation with Docker, creating custom images and containers",
          "Code versioning with Git"
        ]
      },
      "tecnologias": {
        "title": "Technologies"
      }
    }
  },
  "projects": {
    "tiobolas": {
      "title": "Tio Bolas",
      "description": "Team project implementing concepts such as ADT, file manipulation, binary search, and data structures (queue)."
    },
    "hashtable": {
      "title": "HashTable",
      "description": "Project developed to apply data structures 2 course content, implementing hash table and hash function with operations."
    },
    "agenda": {
      "title": "AgendaToDO",
      "description": "API for managing tasks (CRUD) that is part of Simplify's challenge for junior backend developers."
    },
    "codinome": {
      "title": "CodinomeUol",
      "description": "Java application capable of retrieving information from an XML file and a JSON file, persisting a record in an in-memory or file database, and listing records in a simple interface."
    },
    "wallet": {
      "title": "SimplifiedWallet",
      "description": "Simplified payment system. It allows depositing and transferring money between users. We have 2 types of users, regular and merchants, both have wallets with money and make transfers between them."
    },
    "dotnetFinance": {
      "title": ".FinanceAPI",
      "description": "REST version of the banking transaction processing API based on Open Finance, developed in .Net"
    },
    "dotnetMedias": {
      "title": ".MediasAPI",
      "description": "Medias API Project: Grade management and academic score projection. Written in two other stacks - .Net and NodeJS",
      "linkLabel": ".Net",
      "additionalLabel": "NodeJS"
    }
  }
}
